app_praise_me_api2/app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
    def index
        employees = Employee.all

INSERT INTO "employees" ("name", "position", "hire_date") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Maysam Taherian"], ["position", "Compliance Manager"], ["hire_date", "2017-03-13"]]
---
    def create
        employee = Employee.new(employee_params)
        if employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "name" = $1, "position" = $2 WHERE "employees"."id" = $3  [["name", "Ryan Gibeualt"], ["position", "React Dev"], ["id", 7]]
---
    def update
        employee = Employee.find(params[:id])
        employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]
---
    def destroy
        empoyee = Employee.destroy(params[:id])