app_praise_me_api2/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Foster Naylor"], ["email", "Foster@hotmail.com"], ["password_digest", "password"]]