app_praise_me_api/app/controllers/appraisals_controller.rb

    def create
        appraisal = Appraisal.new(appraisal_params)
        if appraisal.save
---
INSERT INTO "appraisals" ("employee_id", "leadership_score", "leadership_description", "people_development_score", "people_development_description", "planning_score", "planning_description", "communication_score", "communication_description", "productivity_score", "productivity_description", "knowledge_score", "knowledge_description", "adaptability_score", "adaptability_description", "initiative_score", "inititative_description", "judgement_score", "judgement_description", "interpersonal_relations_score", "interpersonal_relations_description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"