app_praise_me_api/app/controllers/employees_controller.rb

    def index
        employees = Employee.all
---
SELECT "employees".* FROM "employees"

    def show
        employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        employee = Employee.new(employee_params)
        if employee.save
---
INSERT INTO "employees" ("name", "position", "hire_date", "manager_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mase Taherian"], ["position", "Taco Maker"], ["hire_date", "2018-10-19"], ["manager_id", 1]]

    def update
        employee = Employee.find(params[:id])
        employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "employees" SET "name" = $1, "position" = $2, "hire_date" = $3 WHERE "employees"."id" = $4  [["name", "Neda Hossein"], ["position", "Compliance Manage"], ["hire_date", "2019-10-09"], ["id", 14]]

    def destroy
        empoyee = Employee.destroy(params[:id])
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 11]]