app_praise_me_api2/app/controllers/concerns/notes_controller.rb

SELECT "notes".* FROM "notes"
---
    def index
        notes = Note.all

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        note = Note.find(params[:id])

INSERT INTO "notes" ("note_date", "note_type", "intensity", "canned_note", "description", "employee_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["note_date", "2019-10-01"], ["note_type", "Neutral"], ["intensity", 2], ["canned_note", "Habit 3: Put First Things First."], ["description", "He knew something."], ["employee_id", 10]]
---
    def create
        note = Note.new(note_params)
        if note.save